
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	УстановитьВидимость(); 
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость(); 
	
	ЭтоУслуга = (Объект.ТипНоменклатуры=ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	Элементы.ДлительностьУслуги.Видимость=ЭтоУслуга; 	
	
КонецПроцедуры	

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент) 
	
УстановитьВидимость(); 

Если Объект.ТипНоменклатуры=ПредОпределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		Объект.СчетБухгалтерскогоУчета=ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары")
	ИначеЕсли
		Объект.ТипНоменклатуры=ПредОпределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		Объект.СчетБухгалтерскогоУчета=ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы")
	ИначеЕсли 
		Объект.ТипНоменклатуры=ПредОпределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Объект.СчетБухгалтерскогоУчета=ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу")
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СчетБухгалтерскогоУчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокДоступныхЗначений = Новый СписокЗначений;    
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары"));
	ИначеЕсли  Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу"));
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы"));
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы"));
	Иначе
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка"));
	КонецЕсли;
	
	ДанныеВыбора = СписокДоступныхЗначений;
	
КонецПроцедуры




