
Процедура ПередЗаписью(Отказ)
	
	ДлиннаИННИП = 12;
	ДлиннаИННЮрЛицо = 10;
	
	// Проверяем, что ТипОрганизации заполнен
	Если НЕ ЗначениеЗаполнено(ТипОрганизации) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не указан тип организации!'"),,"Объект.ТипОрганизации",,Отказ);
		//Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтоИндивидуальныйПредприниматель = (ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель"));
	//Проверяем ИНН
	Если Не ПустаяСтрока(ИНН) Тогда
		Если ЭтоИндивидуальныйПредприниматель И СтрДлина(ИНН) <> ДлиннаИННИП Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Длина ИНН для ИП должна быть 12 символов!'"),,"Объект.ИНН",,Отказ);
			//Отказ = Истина;
		ИначеЕсли Не ЭтоИндивидуальныйПредприниматель И СтрДлина(ИНН) <> ДлиннаИННЮрЛицо Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Длина ИНН для юридического лица должна быть 10 символов!'"),,"Объект.ИНН",,Отказ);
			//Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры