
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 	
	
	МинутВЧас=60;
	Если ЗначениеЗаполнено(Услуги) Тогда
		ДлительностьУслуг = РассчитатьДатуОкончанияЗаписи();
		Если ДлительностьУслуг = 0 Тогда 
			ДлительностьУслуг = 60;   
		КонецЕсли; 
		ДатаОкончанияЗаписи = ДатаЗаписи + ДлительностьУслуг*МинутВЧас;
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьДатуОкончанияЗаписи()
	
	ТЧУслуги = Услуги.Выгрузить(,"Услуга,Количество"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧУслуги", ТЧУслуги);
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТЧУслуги.Услуга КАК Номенклатура,
	|	ЕСТЬNULL(ТЧУслуги.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	&ТЧУслуги КАК ТЧУслуги;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(Ном.ДлительностьУслуги, 0) * ВТ_Номенклатура.Количество) КАК ДлительностьУслуги
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ВТ_Номенклатура.Номенклатура = Ном.Ссылка";
	
	Рез = Запрос.Выполнить();
	Если НЕ Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		ОбщаяДлительность = 0;
		Пока Выборка.Следующий() Цикл
			ОбщаяДлительность = ОбщаяДлительность + Выборка.ДлительностьУслуги;
		КонецЦикла; 
		Возврат ОбщаяДлительность;
	Иначе
		возврат 0; 
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	
	//Регистры
	Движения.ЗаказыКлиентов.Записывать = Истина;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредварительнаяЗапись.Клиент КАК Клиент,
	|	ПредварительнаяЗапись.Ссылка КАК ЗаказКлиента,
	|	ПредварительнаяЗапись.Организация КАК Организация,
	|	СУММА(ПредварительнаяЗаписьУслуги.Сумма) КАК Сумма,
	|	ПредварительнаяЗапись.Дата КАК Период
	|ИЗ
	|	Документ.ПредварительнаяЗапись.Услуги КАК ПредварительнаяЗаписьУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительнаяЗапись КАК ПредварительнаяЗапись
	|		ПО ПредварительнаяЗаписьУслуги.Ссылка = ПредварительнаяЗапись.Ссылка
	|ГДЕ
	|	ПредварительнаяЗапись.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительнаяЗапись.Клиент,
	|	ПредварительнаяЗапись.Ссылка,
	|	ПредварительнаяЗапись.Организация";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Заказ Клиентов регистр
		Движение = Движения.ЗаказыКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры


