
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Регистры
	Движения.ТоварыНаСкладах.Записывать = Истина;
	
	Движения.УчетЗатрат.Записывать = Истина; 
	
	Движения.Хозрасчетный.Записывать = Истина;
	
	СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслугУслуги.Услуга КАК Услуга,
	|	СУММА(ПоступлениеТоваровИУслугУслуги.Количество) КАК Количество,
	|	СУММА(ПоступлениеТоваровИУслугУслуги.Сумма) КАК Сумма,
	|	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат
	|ПОМЕСТИТЬ Вт_Услуги
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеТоваровИУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровИУслугУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровИУслугУслуги.Услуга,
	|	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровИУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровИУслугТовары.Количество),
	|	СУММА(ПоступлениеТоваровИУслугТовары.Сумма),
	|	NULL
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровИУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровИУслугТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Услуги.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА Вт_Услуги.Услуга.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга,
	|	Вт_Услуги.Сумма КАК СуммаВДокументе,
	|	Вт_Услуги.Количество КАК КоличествоВДокументе,
	|	Вт_Услуги.СтатьяЗатрат КАК УслугаСтатьяЗатрат,
	|	Вт_Услуги.Услуга.Представление КАК УслугаПредставление,
	|	Вт_Услуги.Услуга.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	Вт_Услуги КАК Вт_Услуги
	|ИТОГИ
	|	МАКСИМУМ(СуммаВДокументе),
	|	СУММА(КоличествоВДокументе)
	|ПО
	|	УслугаСтатьяЗатрат,
	|	Услуга";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаСтатьяЗатрат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатьяЗатрат.Следующий() Цикл
		
		СуммаСебесЗатрат = 0;
		
		ВыборкаУслуга = ВыборкаСтатьяЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУслуга.Следующий() Цикл
			
			Если ВыборкаУслуга.ЭтоУслуга Тогда  
				
				// Регистр "Журнал бухгалтерских проводок услуги"
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ВыборкаУслуга.СчетБухгалтерскогоУчета;
				Движение.СчетКт = СчетКредита;
				Движение.Период = Дата;
				Движение.Сумма = ВыборкаУслуга.СуммаВДокументе;
				Движение.Содержание = "Отражено поступление услуг от поставщика";
				БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, ВыборкаУслуга.УслугаСтатьяЗатрат);
				БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Контрагент);
				
				СуммаСебесЗатрат = СуммаСебесЗатрат + ВыборкаУслуга.СуммаВДокументе;
				
			Иначе 
				// ТоварыНаСкладах регистр
				Движение = Движения.ТоварыНаСкладах.ДобавитьПриход();
				Движение.Период = Дата;
				Движение.Номенклатура = ВыборкаУслуга.Услуга;
				Движение.Склад = Склад;
				Движение.Количество = ВыборкаУслуга.КоличествоВДокументе;
				Движение.Сумма = ВыборкаУслуга.СуммаВДокументе;
				Движение.Организация = Организация; 
				
				// Регистр "Журнал бухгалтерских проводок товары"
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ВыборкаУслуга.СчетБухгалтерскогоУчета;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
				Движение.Период = Дата;
				Движение.Сумма = ВыборкаУслуга.СуммаВДокументе;
				Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчтные.Номенклатура] = ВыборкаУслуга.Услуга;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчтные.Контрагенты] = Контрагент;
			КонецЕсли;
			
		КонецЦикла;
		//  УчетЗатрат регистр
		Если СуммаСебесЗатрат > 0 Тогда
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период = Дата;
			Движение.Организация =Организация;
			Движение.СтатьяЗатрат = ВыборкаСтатьяЗатрат.УслугаСтатьяЗатрат;
			Движение.Сумма = СуммаСебесЗатрат;
		КонецЕсли;
		
	КонецЦикла;  
	
КонецПроцедуры;