
&НаКлиенте
Процедура УстановитьВидимость() 
	
	СтрокаТипПлательщика="";	
	Если Объект.ВидОперации=ПредопределенноеЗначение ("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда
		Элементы.Договор.Видимость=Ложь;
		СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
	Иначе
		Элементы.Договор.Видимость=Истина;
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
	КонецЕсли;
	Если ЗначениеЗаполнено (СтрокаТипПлательщика) Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПлательщика));
		ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);
		Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;	
	КонецЕсли;
	Если Элементы.Договор.Видимость = Истина
		И ЗначениеЗаполнено (Объект.Плательщик) Тогда
		Элементы.Договор.Видимость = РаботаСТипомКонтрагентаСервер.ПроверитьВидимостьДоговораОтКонтрагента (Объект.Плательщик);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент) 
	
	УстановитьВидимость();   
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный=Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	УстановитьВидимость(); 
	
КонецПроцедуры

