&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	УстановитьВидимость();  
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоИндивидуальныйПредприниматель = (Объект.ТипОрганизации =ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель"));
	ЭтоЮридическоеЛицо = (Объект.ТипОрганизации =ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо"));
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
		Объект.ГлавныйБухгалтер = Неопределено;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	КонецЕсли;     
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)  
	
	УстановитьВидимость(); 
	Объект.ИНН = "";    
	
КонецПроцедуры 

