
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьВидимость();
	
	ЭтоКлиент= (Объект.ТипКонтрагента=ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент"));
	ЭтоПоставщик= (Объект.ТипКонтрагента=ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Поставщик")); 
	ЭтоПокупатель= (Объект.ТипКонтрагента=ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель"));
	Если ЭтоКлиент Тогда
		Элементы.Наименование.Заголовок="ФИО";
	Иначе
		Элементы.Наименование.Заголовок="Наименование";
	КонецЕсли;
	Элементы.ДатаРожденияКлиента.Видимость=ЭтоКлиент;
	Элементы.ПолКлиента.Видимость=ЭтоКлиент;
	Элементы.Договор.Видимость=ЭтоПоставщик ИЛИ ЭтоПокупатель
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
УстановитьВидимость();
КонецПроцедуры
