
&НаКлиенте
Процедура УстановитьВидимость()
	СтрокаТипПлательщика="";	
	Если Объект.ВидОперации=ПредопределенноеЗначение ("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику") 
		ИЛИ Объект.ВидОперации=ПредопределенноеЗначение ("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты")
		Тогда
		Элементы.Договор.Видимость=Ложь;
		СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
	Иначе
		Элементы.Договор.Видимость=Истина;
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
	КонецЕсли;
	Если ЗначениеЗаполнено (СтрокаТипПлательщика) Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПлательщика));
		ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);
		Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПлательщика;	
	КонецЕсли;
	Если Элементы.Договор.Видимость = Истина
		И ЗначениеЗаполнено (Объект.Получатель) Тогда
		Элементы.Договор.Видимость = РаботаСТипомКонтрагентаСервер.ПроверитьВидимостьДоговораОтКонтрагента (Объект.Получатель);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный=Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость(); 
КонецПроцедуры

