
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реализация";
	КомандаПечати.Представление = НСтр("ru = 'Реализация'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр);
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Реализация") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию( КоллекцияПечатныхФорм, "Реализация", НСтр("ru = 'Реализация'"),СформироватьПечатнуюФормуРеализация(МассивОбъектов, ОбъектыПечати), ,"Документ.Реализация.ПФ_XML_Реализация");
	КонецЕсли;
	
КонецПроцедуры  

Функция СформироватьПечатнуюФормуРеализация(МассивОбъектов, ОбъектыПечати) Экспорт
	ТекстЗапорса =
	"ВЫБРАТЬ
	|	Реализация.Ответственный КАК Ответственный,
	|	Реализация.Дата КАК Дата,
	|	Реализация.Контрагент КАК Контрагент,
	|	Реализация.Номер КАК Номер,
	|	Реализация.Сотрудник КАК Сотрудник,
	|	Реализация.СуммаДокумента КАК СуммаДокумента,
	|	Реализация.Организация КАК Организация,
	|	Реализация.ДокументОснование КАК ДокументОснование,
	|	Реализация.Договор КАК Договор,
	|	Реализация.Склад КАК Склад,
	|	Реализация.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	Реализация.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги,
	|	Реализация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В(&СписокДокументов)";
	
	Запрос = Новый Запрос(ТекстЗапорса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "Реализация";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Реализация.ПФ_XML_Реализация");
	
	ОбластьЗаголовок     = Макет.ПолучитьОбласть("Заголовок");
	Шапка                 = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка     = Макет.ПолучитьОбласть("ШапкаУслуги");
	ОбластьУслуги         = Макет.ПолучитьОбласть("Услуга");
	ОбластьТоварыШапка     = Макет.ПолучитьОбласть("ШапкаТовары");
	ОбластьТовары         = Макет.ПолучитьОбласть("Товары");
	Подвал                 = Макет.ПолучитьОбласть("Подвал");
	
	Пока Выборка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		//получаем данные организации
		ДанныеОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Выборка.Организация);
		Если ЗначениеЗаполнено(ДанныеОрганизации) Тогда
			Шапка.Параметры.Организация =  ДанныеОрганизации.Наименование;
			Подвал.Параметры.ГлавныйБухгалтер = ДанныеОрганизации.ГлавныйБухгалтер;
			Подвал.Параметры.Руководитель = ДанныеОрганизации.Руководитель;
		КонецЕсли;
		
		//Заголовок
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);  
		
		//Шапка
		Шапка.Параметры.Заполнить(Выборка); 
		ТабличныйДокумент.Вывести(Шапка);
		
		
		//Товары 
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Если ВыборкаТовары.Количество() Тогда
			ТабличныйДокумент.Вывести(ОбластьТоварыШапка);
			Пока ВыборкаТовары.Следующий() Цикл
				ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
				ТабличныйДокумент.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			КонецЦикла;
		КонецЕсли;
		
		//Услуги
		ВыборкаУслуги = Выборка.Услуги.Выбрать(); 
		Если ВыборкаУслуги.Количество() Тогда
			ТабличныйДокумент.Вывести(ОбластьУслугиШапка);
			Пока ВыборкаУслуги.Следующий() Цикл
				ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
				ТабличныйДокумент.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
			КонецЦикла; 
		КонецЕсли;	
		
		//Подвал
		Подвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Подвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка); //3
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	
	
КонецФункции  
// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт  
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.Реализация);   
	
КонецФункции     


//Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт 
	
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании); 
	Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
КонецПроцедуры



#КонецОбласти 	


