
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения)   =  Тип("ДокументСсылка.ПредварительнаяЗапись") Тогда
		ДанныеЗаполенияОснования = Новый Структура;
		ДанныеЗаполенияОснования  = ПолучитьДанныеПоПредварительнаяЗапись(ДанныеЗаполнения);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполенияОснования);
		ЭтотОбъект.Услуги.Очистить();
		// Получаем табличную часть Услуги из результата запроса
		УслугиИзПредварительнойЗаписи = ДанныеЗаполнения.Услуги;
		// Заполняем ТЧ Услуги документа Реализация
		Для Каждого СтрокаУслуги Из УслугиИзПредварительнойЗаписи Цикл
			НоваяСтрокаТЧ = ЭтотОбъект.Услуги.Добавить(); 
			// Заполняем поля строки ТЧ 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаУслуги);  
		КонецЦикла;
	КонецЕсли
КонецПроцедуры

Функция ПолучитьДанныеПоПредварительнаяЗапись(ДанныеЗаполнения)
	
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредварительнаяЗапись.Организация КАК Организация,
	|	ПредварительнаяЗапись.Клиент КАК Контрагент,
	|	ПредварительнаяЗапись.Сотрудник КАК Сотрудник,
	|	ПредварительнаяЗапись.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги,
	|	ПредварительнаяЗапись.СуммаДокумента КАК СуммаДокумента,
	|	ПредварительнаяЗапись.Дата КАК Дата,
	|	ПредварительнаяЗапись.Номер КАК Номер,
	|	ПредварительнаяЗапись.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПредварительнаяЗапись КАК ПредварительнаяЗапись
	|ГДЕ
	|	ПредварительнаяЗапись.Ссылка = &Ссылка";
	
	Выборка =  Запрос.Выполнить().Выбрать();
	Выборка.Следующий(); 
	
	// Выгружаем результат в структуру
	Результат = Новый Структура;
	Результат.Вставить("Организация", Выборка.Организация);
	Результат.Вставить("Контрагент", Выборка.Контрагент);
	Результат.Вставить("Сотрудник", Выборка.Сотрудник); 
	Результат.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
	Результат.Вставить("Комментарий",СтрШаблон ("Введен на основании:№%1 от %2",Выборка.Номер,Выборка.Дата));   
	Результат.Вставить("ДокументОснование",Выборка.ССылка);
	
	// Выгружаем ТЧ "Услуги" в таблицу значений
	ТЧУслуги = Выборка.Услуги.Выгрузить();
	Результат.Вставить("Услуги", ТЧУслуги);
	
	Возврат Результат;
КонецФункции          

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	//Регистры
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.УчетЗатрат.Записывать = Истина;  
	Движения.ЗаказыКлиентов.Записывать = Истина; 
	Движения.Хозрасчетный.Записывать = Истина;
	
	Движения.ТоварыНаСкладах.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный; 
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ Вт_Товары
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга,
	|	СУММА(РеализацияУслуги.Количество),
	|	СУММА(РеализацияУслуги.Сумма)
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Вт_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	Вт_Товары.Сумма КАК СуммаВДокументе,
	|	Вт_Товары.Количество КАК КоличествоВДокументе,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	Вт_Товары.Номенклатура.СтатьяЗатрат КАК ТоварСтатьяЗатрат,
	|	Вт_Товары.Номенклатура.Представление КАК ТоварПредставление,
	|	Вт_Товары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	Вт_Товары КАК Вт_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				Склад = &Склад
	|					И Организация = &Организация
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							Вт_Товары.Номенклатура
	|						ИЗ
	|							Вт_Товары КАК Вт_Товары)) КАК ТоварыНаСкладахОстатки
	|		ПО Вт_Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|ИТОГИ
	|	МАКСИМУМ(СуммаВДокументе),
	|	МАКСИМУМ(КоличествоВДокументе),
	|	СУММА(КоличествоОстаток)
	|ПО
	|	ТоварСтатьяЗатрат";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаСтатьяЗатрат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатьяЗатрат.Следующий() Цикл
		
		СуммаСебесЗатрат = 0;
		
		ВыборкаТовар = ВыборкаСтатьяЗатрат.Выбрать();
		
		ОсталосьСписать = ВыборкаСтатьяЗатрат.КоличествоВДокументе;
		
		Пока ВыборкаТовар.Следующий()  И ОсталосьСписать > 0 И ВыборкаТовар.КоличествоОстаток > 0 Цикл
			
			Если ВыборкаТовар.ЭтоТовар Тогда // товар — списываем со склада
				
				СтоимостьОбщая = 0;
				
				Превышение = ВыборкаТовар.КоличествоВДокументе - ВыборкаТовар.КоличествоОстаток;
				Если Превышение > 0 Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Превышение остатка по ном. ""%1"" в количестве %2", 
					ВыборкаТовар.ТоварПредставление, Превышение));
					Отказ = Истина;
				КонецЕсли;
				
				
				// Выбор детальных остатков по текущей номенклатуре
				
				//Пока ВыборкаТовар.Следующий() И ОсталосьСписать > 0 И ВыборкаТовар.КоличествоОстаток > 0 Цикл
				
				Списываем = Мин(ВыборкаТовар.КоличествоОстаток, ОсталосьСписать);
				
				// Товары на складах
				Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Номенклатура = ВыборкаТовар.Номенклатура;
				Движение.Склад = Склад;
				Движение.Количество = Списываем;
				
				// проблема копеек
				Если Списываем >= ВыборкаТовар.КоличествоОстаток Тогда
					СуммаСписания = ВыборкаТовар.СуммаОстаток;
				Иначе
					СуммаСписания = ВыборкаТовар.СуммаОстаток / ВыборкаТовар.КоличествоОстаток * Списываем;
				КонецЕсли;
				
				Движение.Сумма = СуммаСписания;
				СтоимостьОбщая = СтоимостьОбщая + СуммаСписания;
				
				ОсталосьСписать = ОсталосьСписать - Списываем; 
				
				//Проводка по списанию товаров и материалов Дт90 Кт10/41
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
				Движение.СчетКт = ВыборкаТовар.СчетБухгалтерскогоУчета;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчтные.Номенклатура] = ВыборкаТовар.Номенклатура; 
				Движение.Период    = Дата;    
				Движение.Сумма = СуммаСписания;
				Движение.Содержание    = "Списана себестоимость товарно-материальных ценностей";
				
				//КонецЦикла;
				
				СуммаСебесЗатрат = СуммаСебесЗатрат + СтоимостьОбщая;
				
			КонецЕсли;
			// Продажи
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаТовар.Номенклатура;
			Движение.Сотрудник = Сотрудник;
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Количество = ВыборкаТовар.КоличествоВДокументе; 
			Движение.Сумма = ВыборкаТовар.СуммаВДокументе;	
		КонецЦикла;	
		
		Если СуммаСебесЗатрат > 0 Тогда 
			
			// УчетЗатрат
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СтатьяЗатрат = ВыборкаСтатьяЗатрат.ТоварСтатьяЗатрат;
			Движение.Сумма = СуммаСебесЗатрат;
		КонецЕсли;
	КонецЦикла; 
	
	//Проводка по отражению выручки Дт62 Кт90
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Контрагент);
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";
	
	//  ЗаказКлиентов 
	Если  ЗначениеЗаполнено(ДокументОснование) И Услуги.Итог("Сумма")<> 0 Тогда
		Движение = Движения.ЗаказыКлиентов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Клиент = Контрагент;
		Движение.ЗаказКлиента = ДокументОснование;
		Движение.Сумма = Услуги.Итог("Сумма"); 
	КонецЕсли
	
КонецПроцедуры;
