
//Процедура ВыполнитьАутентификацию(Логин) Экспорт
//	
//	IP=константы.АдресIP.Получить();
//	Соединение    = Новый HTTPСоединение(IP,,"MobileClient");
//	Запрос        = Новый HTTPЗапрос("BeautySalon/hs/users/getUser?username="+Логин);
//	Ответ        = Соединение.Получить(Запрос);   
//	Если Ответ.КодСостояния = 200 Тогда
//		ДанныеПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());  
//				ИначеЕсли ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда 
//			АвторизоватьПользователя(ДанныеПользователя);
//		КонецЕсли;
//	Иначе
//		Сообщить("При попытке аутентификации произошла ошибка!"); 
//		
//	КонецЕсли;
//	    Если Ответ.КодСостояния = 401 Тогда
//		  //Если Ответ.КодСостояния = 401 Тогда
//			Сообщить("По логину " + Логин +" пользователь не найден!");
//     КонецЕсли 
//КонецПроцедуры  

Процедура ВыполнитьАутентификацию(Логин) Экспорт

    IP = константы.АдресIP.Получить();
    Соединение = Новый HTTPСоединение(IP, , "MobileClient");
    Запрос = Новый HTTPЗапрос("BeautySalon/hs/users/getUser?username=" + Логин);
    Ответ = Соединение.Получить(Запрос);

    Если Ответ.КодСостояния = 200 Тогда
        ДанныеПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());  
        Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда 
            АвторизоватьПользователя(ДанныеПользователя);
        КонецЕсли;
    ИначеЕсли Ответ.КодСостояния = 401 Тогда 
        Сообщить("По логину " + Логин + " пользователь не найден!");
	Иначе 
		Сообщить("При попытке аутентификации произошла ошибка!"); 
    КонецЕсли;

КонецПроцедуры

Процедура АвторизоватьПользователя(ДанныеПользователя) Экспорт
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = ДанныеПользователя.name;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
	НовыйПользовательИБ.Записать();
	
	ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя.name);
	Если ТекущийПользователь.Пустая() Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Код =  ДанныеПользователя.code;
		НовыйПользователь.ВнешнийGUID = ДанныеПользователя.guid;   
		НовыйПользователь.Наименование = ДанныеПользователя.name;
		НовыйПользователь.Записать(); 
		ТекущийПользователь = НовыйПользователь.Ссылка; 
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
	
КонецПроцедуры

Процедура Разлогиниться() Экспорт 
	
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
		ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();    
	КонецЕсли;
	
КонецПроцедуры

