&НаСервереБезКонтекста
Функция ПолучитьСтоимостьУслуги(ВыбраннаяУслуга) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Услуги.Стоимость КАК Стоимость
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяУслуга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий()Тогда
		Возврат Выборка.Стоимость
	КонецЕсли;
	                                                  
КонецФункции

&НаКлиенте
 Процедура УслугиУслугаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		Стоимость = ПолучитьСтоимостьУслуги(СтрокаТЧ.Услуга);
		СтрокаТЧ.Стоимость = Стоимость;
	Иначе
		СтрокаТЧ.Стоимость = 0;
	КонецЕсли;
	 
 КонецПроцедуры

