
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость(); 
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.Бессрочный Тогда
		Элементы.ДатаОкончания.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
			Объект.ДатаОкончания = '0001,01,01';
		КонецЕсли;	
	Иначе
		Элементы.ДатаОкончания.Видимость = Истина;		
	КонецЕсли;	
КонецПроцедуры  


&НаКлиенте
Процедура СформироватьНаименованиеДоговора() 
	ДатаЗаключенияДоговораБезВремени= Формат(Объект.ДатаНачала,"ДФ='dd.MM.yyyy'");
	Если ЗначениеЗаполнено(Объект.Номер) 
		И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер + " от " + ДатаЗаключенияДоговораБезВремени+"г.";
	ИначеЕсли  ЗначениеЗаполнено(Объект.Номер)
		И НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + ДатаЗаключенияДоговораБезВремени+"г."; 
	Иначе
		Объект.Наименование = " от " + ДатаЗаключенияДоговораБезВремени+"г.";	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьНаименованиеДоговора(); 
КонецПроцедуры

