
 Функция ПроверитьВидимостьДоговораОтКонтрагента (ЗНАЧ Плательщик)     Экспорт
	 Запрос = Новый Запрос;
	 Запрос.Текст ="ВЫБРАТЬ
	 |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
	 |	Контрагенты.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.Контрагенты КАК Контрагенты
	 |ГДЕ
	 |	Контрагенты.Ссылка = &Плательщик";
	 Запрос.УстановитьПараметр("Плательщик", Плательщик);
	 Выборка = Запрос.Выполнить().Выбрать();
	 Выборка.Следующий();
	 Если ЗначениеЗаполнено (Выборка.ТипКонтрагента)
		 И Выборка.ТипКонтрагента= Перечисления.ТипыКонтрагентов.Клиент Тогда
		 возврат Ложь;
	 Иначе
		 возврат Истина;
	 КонецЕсли;
 КонецФункции

 Функция КонтрагентЯвляетсяПокупателем(КонтрагентСсылка)  Экспорт
    
    Запрос = Новый Запрос;  
    Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
    Запрос.УстановитьПараметр("ТипКонтрагентов", Перечисления.ТипыКонтрагентов.Покупатель);
    Запрос.Текст = 
    "ВЫБРАТь
    |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
    |ИЗ
    |	Справочник.Контрагенты КАК Контрагенты
    |ГДЕ
    |	Контрагенты.Ссылка = &КонтрагентСсылка
    |	И Контрагенты.ТипКонтрагента = &ТипКонтрагентов";     
    Результат = Запрос.Выполнить();
    
    Возврат Результат.Пустой()     
КонецФункции

