
&НаКлиенте
Процедура Записаться(Команда)
	
	ВыбраннаяДата = ЭтаФорма.Объект.ДатаЗаписи;
	
	Если ВыбраннаяДата < ТекущаяДата() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя записаться на прошедшую дату.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ЗаписатьсяНаСервере() Тогда
		ОткрытьФорму("Документ.ЗаписьКлиента.Форма.ФормаСписка");
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Вы записаны на услугу ""%1"" к мастеру %2 на дату %3", 
		Объект.Услуга, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'"));                                    
		СообщениеПользователю.Сообщить();
		
		//Очистим реквизиты формы после успешной отправки документа
		ЭтаФорма.Объект.ДатаЗаписи = '00010101';
		ЭтаФорма.Объект.Сотрудник = "";
		ЭтаФорма.Объект.Услуга = "";
		ЭтаФорма.ЭтаФорма.Стоимость = 0; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьсяНаСервере()
	
	ЗаписьКлиента = Документы.ЗаписьКлиента.СоздатьДокумент();
	ЗаписьКлиента.Дата        = НачалоМинуты(Объект.ДатаЗаписи);
	ЗаписьКлиента.Сотрудник = Объект.Сотрудник;
	
	СтрокаУслуги = ЗаписьКлиента.Услуги.Добавить();
	СтрокаУслуги.Услуга        = Объект.Услуга;
	СтрокаУслуги.Стоимость    = ЭтаФорма.Стоимость;
	
	//Создаем JSON
	СтруктураРеквизитовДокумента = Новый Структура;
	СтруктураРеквизитовДокумента.Вставить("ДатаЗаписи", Объект.ДатаЗаписи);
	СтруктураРеквизитовДокумента.Вставить("Сотрудник", СокрЛП(Строка(Объект.Сотрудник)));
	СтруктураРеквизитовДокумента.Вставить("ПользовательМП", ПараметрыСеанса.ТекущийПользователь.Наименование);
	
	МассивУслуг = Новый Массив;
	
	Услуга = Новый Структура;
	Услуга.Вставить("Номенклатура", Строка(Объект.Услуга));
	Услуга.Вставить("Цена", ЭтаФорма.Стоимость);
	Услуга.Вставить("Количество", 1);
	Услуга.Вставить("Сумма", ЭтаФорма.Стоимость);
	
	МассивУслуг.Добавить(Услуга);
	СтруктураРеквизитовДокумента.Вставить("МассивУслуг", МассивУслуг);   
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента); 
	
	//Отправляем документ Запись в основную базу
	ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
	Если ДокументУспешноОтправлен Тогда        
		ЗаписьКлиента.Записать(РежимЗаписиДокумента.Проведение); 
		Возврат Истина
	Иначе    
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст    = "Не удалось отправить Запись!";
		СообщениеПользователю.Сообщить();
		
		Возврат Ложь 
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьУслуги(ВыбраннаяУслуга) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Услуги.Стоимость КАК Стоимость
	|ИЗ
	|	Справочник.Услуги КАК Услуги
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяУслуга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий()Тогда
		Возврат Выборка.Стоимость
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Стоимость = ПолучитьСтоимостьУслуги(Объект.Услуга);
КонецПроцедуры
