
//Функция getUserGET(Запрос)
//	
//	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username")); 
//	
//	ЗапросПользователи = Новый Запрос;
//	ЗапросПользователи.Текст = "ВЫБРАТЬ
//	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Ссылка,
//	|	Контрагенты.ПользовательМП КАК Наименование,
//	|	Контрагенты.Код КАК Код
//	|ИЗ
//	| Справочник.Контрагенты КАК Контрагенты
//	|		
//	|ГДЕ
//	|	НЕ Контрагенты.ПометкаУдаления
//	|	И Контрагенты.ПользовательМП = &Наименование
//	|		                           
//	|УПОРЯДОЧИТЬ ПО
//	|	Наименование";
//	
//	ЗапросПользователи.УстановитьПараметр("Наименование", Логин);            
//	РезультатЗапроса = ЗапросПользователи.Выполнить();
//	
//	  
//		
//		//МассивПользователей= Новый Массив; 
//		
//		Выборка = РезультатЗапроса.Выбрать(); 
//		 ПользовательЕсть = Ложь;
//		Пока Выборка.Следующий() Цикл	
//			ДанныеПользователя = Новый Структура; 
//			ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
//			ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
//			ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
//			ПользовательЕсть = Истина;
//			Прервать;
//			//МассивПользователей.Добавить(ДанныеПользователя);
//			
//		Ответ = Новый HTTPСервисОтвет(200);	
//		СтрокаОтвета = ОбщегоНазначения.ЗначениеВJSON(ДанныеПользователя);
//		
//		Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); 
//		
//	Иначе 
//		Ответ = Новый HTTPСервисОтвет(401);
//		
//		Возврат Ответ;
//	КонецЕсли 
//	КонецЦикла
//КонецФункции
Функция getUserGET(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	ЗапросПользователи = Новый Запрос;
	ЗапросПользователи.Текст = "ВЫБРАТЬ
	|    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Ссылка,
	|    Контрагенты.ПользовательМП КАК Наименование,
	|    Контрагенты.Код КАК Код
	|ИЗ
	|    Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|    НЕ Контрагенты.ПометкаУдаления
	|    И Контрагенты.ПользовательМП = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|    Наименование";
	
	ЗапросПользователи.УстановитьПараметр("Наименование", Логин);
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ПользовательЕсть = Ложь;
	
	Пока Выборка.Следующий() Цикл
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
		ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
		ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
		
		ПользовательЕсть = Истина;
		Прервать;
	КонецЦикла;
	
	Если ПользовательЕсть Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		СтрокаОтвета = ОбщегоНазначения.ЗначениеВJSON(ДанныеПользователя);
		Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	Иначе
		Ответ = Новый HTTPСервисОтвет(401);
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
