
Функция createOrderPOST(Запрос)
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	ДанныеЗапроса = ОбщегоНазначения.JSONВЗначение(СтрокаJSON,"ДатаЗаписи", Ложь);
	НоваяЗапись = Документы.ПредварительнаяЗапись.СоздатьДокумент();
	НоваяЗапись.Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ДанныеЗапроса.Сотрудник);
	НоваяЗапись.Клиент = Справочники.Контрагенты.НайтиПоРеквизиту("ПользовательМП",ДанныеЗапроса.ПользовательМП);
	НоваяЗапись.Дата = ТекущаяДата();
	НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
	НоваяЗапись.Организация = Константы.ОсновнаяОрганизация.Получить();
	НоваяЗапись.ДатаЗаписи = ДанныеЗапроса.ДатаЗаписи; 
	Для Каждого СтруктураУслуги Из ДанныеЗапроса.МассивУслуг Цикл
		НоваяУслуга = НоваяЗапись.Услуги.Добавить();
		НоваяУслуга.Услуга  = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураУслуги.Номенклатура);
		НоваяУслуга.Цена = Число(СтруктураУслуги.Цена);
		НоваяУслуга.Количество = Число(СтруктураУслуги.Количество);
		НоваяУслуга.Сумма = Число(СтруктураУслуги.Сумма);
		НоваяЗапись.СуммаДокумента = НоваяЗапись.СуммаДокумента + НоваяУслуга.Сумма;
	КонецЦикла;
	
	Попытка
		НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение);
		ТекстОтвета = "Создан и проведен документ " + НоваяЗапись.Номер;
		Ответ = Новый HTTPСервисОтвет(200);
	Исключение
		НоваяЗапись.Записать();
		Ответ = Новый HTTPСервисОтвет(500);
		ТекстОтвета = "Произошла ошибка при проведении документа " + НоваяЗапись.Номер + "! ";
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ;
КонецФункции  

