
Функция JSONВОбъект(СтрокаЧтения) Экспорт  
	
	ЧтениеДанных = Новый ЧтениеJSON;
	ЧтениеДанных.УстановитьСтроку(СтрокаЧтения);            
	Объект = ПрочитатьJSON(ЧтениеДанных);    
	Возврат Объект;
	
КонецФункции

Функция ПолучитьТекстJSON(ДанныеJSON) Экспорт  
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);    
	Возврат ЗаписьJSON.Закрыть(); 
	
КонецФункции

Функция ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON) Экспорт   
	
	IP=константы.АдресIP.Получить();
	Соединение = Новый HTTPСоединение(IP,,"MobileClient");
	HTTPЗапрос     = Новый HTTPЗапрос("BeautySalon/hs/customerOrders/createOrder");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтруктураРеквизитовДокументаJSON);  
	
	Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда        
		УспешноОтправлен = Истина;
	Иначе
		УспешноОтправлен = Ложь;
	КонецЕсли;
	
	Возврат УспешноОтправлен;    
КонецФункции